ataradov/mcu-starter-projects/samg53/include/pio/samg53g19.h
#define PIN_PA17B_PMC_PCK1                         _L_(17)      /**< PMC signal: PCK1 on PA17 mux B*/
#define MUX_PA17B_PMC_PCK1                         _L_(1)       /**< PMC signal line function value: PCK1 */
#define PIO_PA17B_PMC_PCK1                         (_UL_(1) << 17)

#define PIN_PA21B_PMC_PCK1                         _L_(21)      /**< PMC signal: PCK1 on PA21 mux B*/
#define MUX_PA21B_PMC_PCK1                         _L_(1)       /**< PMC signal line function value: PCK1 */
#define PIO_PA21B_PMC_PCK1                         (_UL_(1) << 21)

#define PIN_PA18B_PMC_PCK2                         _L_(18)      /**< PMC signal: PCK2 on PA18 mux B*/
#define MUX_PA18B_PMC_PCK2                         _L_(1)       /**< PMC signal line function value: PCK2 */
#define PIO_PA18B_PMC_PCK2                         (_UL_(1) << 18)

#define PIN_PB3B_PMC_PCK2                          _L_(35)      /**< PMC signal: PCK2 on PB3 mux B*/
#define MUX_PB3B_PMC_PCK2                          _L_(1)       /**< PMC signal line function value: PCK2 */
#define PIO_PB3B_PMC_PCK2                          (_UL_(1) << 3)

/* ========== PIO definition for SPI peripheral ========== */
#define PIN_PA12A_SPI_MISO                         _L_(12)      /**< SPI signal: MISO on PA12 mux A*/
#define MUX_PA12A_SPI_MISO                         _L_(0)       /**< SPI signal line function value: MISO */
#define PIO_PA12A_SPI_MISO                         (_UL_(1) << 12)

#define PIN_PA13A_SPI_MOSI                         _L_(13)      /**< SPI signal: MOSI on PA13 mux A*/
#define MUX_PA13A_SPI_MOSI                         _L_(0)       /**< SPI signal line function value: MOSI */
#define PIO_PA13A_SPI_MOSI                         (_UL_(1) << 13)

#define PIN_PA11A_SPI_NPCS0                        _L_(11)      /**< SPI signal: NPCS0 on PA11 mux A*/
#define MUX_PA11A_SPI_NPCS0                        _L_(0)       /**< SPI signal line function value: NPCS0 */
#define PIO_PA11A_SPI_NPCS0                        (_UL_(1) << 11)

#define PIN_PA5B_SPI_NPCS1                         _L_(5)       /**< SPI signal: NPCS1 on PA5 mux B*/
#define MUX_PA5B_SPI_NPCS1                         _L_(1)       /**< SPI signal line function value: NPCS1 */
#define PIO_PA5B_SPI_NPCS1                         (_UL_(1) << 5)

#define PIN_PB2B_SPI_NPCS1                         _L_(34)      /**< SPI signal: NPCS1 on PB2 mux B*/
#define MUX_PB2B_SPI_NPCS1                         _L_(1)       /**< SPI signal line function value: NPCS1 */
#define PIO_PB2B_SPI_NPCS1                         (_UL_(1) << 2)

#define PIN_PA14A_SPI_SPCK                         _L_(14)      /**< SPI signal: SPCK on PA14 mux A*/
#define MUX_PA14A_SPI_SPCK                         _L_(0)       /**< SPI signal line function value: SPCK */
#define PIO_PA14A_SPI_SPCK                         (_UL_(1) << 14)

/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA2A_TC0_TCLK0                         _L_(2)       /**< TC0 signal: TCLK0 on PA2 mux A*/
#define MUX_PA2A_TC0_TCLK0                         _L_(0)       /**< TC0 signal line function value: TCLK0 */
#define PIO_PA2A_TC0_TCLK0                         (_UL_(1) << 2)

#define PIN_PA19A_TC0_TCLK1                        _L_(19)      /**< TC0 signal: TCLK1 on PA19 mux A*/
#define MUX_PA19A_TC0_TCLK1                        _L_(0)       /**< TC0 signal line function value: TCLK1 */
#define PIO_PA19A_TC0_TCLK1                        (_UL_(1) << 19)

#define PIN_PA20A_TC0_TCLK2                        _L_(20)      /**< TC0 signal: TCLK2 on PA20 mux A*/
#define MUX_PA20A_TC0_TCLK2                        _L_(0)       /**< TC0 signal line function value: TCLK2 */
#define PIO_PA20A_TC0_TCLK2                        (_UL_(1) << 20)

#define PIN_PA0B_TC0_TIOA0                         _L_(0)       /**< TC0 signal: TIOA0 on PA0 mux B*/
#define MUX_PA0B_TC0_TIOA0                         _L_(1)       /**< TC0 signal line function value: TIOA0 */
#define PIO_PA0B_TC0_TIOA0                         (_UL_(1) << 0)

#define PIN_PA23B_TC0_TIOA1                        _L_(23)      /**< TC0 signal: TIOA1 on PA23 mux B*/
#define MUX_PA23B_TC0_TIOA1                        _L_(1)       /**< TC0 signal line function value: TIOA1 */
#define PIO_PA23B_TC0_TIOA1                        (_UL_(1) << 23)

#define PIN_PA21A_TC0_TIOA2                        _L_(21)      /**< TC0 signal: TIOA2 on PA21 mux A*/
#define MUX_PA21A_TC0_TIOA2                        _L_(0)       /**< TC0 signal line function value: TIOA2 */
#define PIO_PA21A_TC0_TIOA2                        (_UL_(1) << 21)

#define PIN_PA1B_TC0_TIOB0                         _L_(1)       /**< TC0 signal: TIOB0 on PA1 mux B*/
#define MUX_PA1B_TC0_TIOB0                         _L_(1)       /**< TC0 signal line function value: TIOB0 */
#define PIO_PA1B_TC0_TIOB0                         (_UL_(1) << 1)

#define PIN_PA16B_TC0_TIOB1                        _L_(16)      /**< TC0 signal: TIOB1 on PA16 mux B*/
#define MUX_PA16B_TC0_TIOB1                        _L_(1)       /**< TC0 signal line function value: TIOB1 */
#define PIO_PA16B_TC0_TIOB1                        (_UL_(1) << 16)

#define PIN_PA22A_TC0_TIOB2                        _L_(22)      /**< TC0 signal: TIOB2 on PA22 mux A*/
#define MUX_PA22A_TC0_TIOB2                        _L_(0)       /**< TC0 signal line function value: TIOB2 */
#define PIO_PA22A_TC0_TIOB2                        (_UL_(1) << 22)

/* ========== PIO definition for TWI1 peripheral ========== */
#define PIN_PB9A_TWI1_TWCK1                        _L_(41)      /**< TWI1 signal: TWCK1 on PB9 mux A*/
#define MUX_PB9A_TWI1_TWCK1                        _L_(0)       /**< TWI1 signal line function value: TWCK1 */
#define PIO_PB9A_TWI1_TWCK1                        (_UL_(1) << 9)

#define PIN_PB11A_TWI1_TWCK1                       _L_(43)      /**< TWI1 signal: TWCK1 on PB11 mux A*/
#define MUX_PB11A_TWI1_TWCK1                       _L_(0)       /**< TWI1 signal line function value: TWCK1 */
#define PIO_PB11A_TWI1_TWCK1                       (_UL_(1) << 11)

#define PIN_PB8A_TWI1_TWD1                         _L_(40)      /**< TWI1 signal: TWD1 on PB8 mux A*/
#define MUX_PB8A_TWI1_TWD1                         _L_(0)       /**< TWI1 signal line function value: TWD1 */
#define PIO_PB8A_TWI1_TWD1                         (_UL_(1) << 8)

#define PIN_PB10A_TWI1_TWD1                        _L_(42)      /**< TWI1 signal: TWD1 on PB10 mux A*/
#define MUX_PB10A_TWI1_TWD1                        _L_(0)       /**< TWI1 signal line function value: TWD1 */
#define PIO_PB10A_TWI1_TWD1                        (_UL_(1) << 10)

